import math


def area(r):
    """
    Принимает радиус круга (r) и возвращает его площадь

    Пример вызова:

    >>> area(9.7)
    295.5924527762636

    :param r: Радиус круга - целое|дробное десятичное число
    :type r: int | float

    :return: Площадь круга - целое|дробное десятичное число
    :rtype: float
    """
    return math.pi * r * r


def perimeter(r):
    """
    Принимает радиус круга (r) и возвращает его периметр

    Пример вызова:

    >>> perimeter(9.7)
    60.94689747964198

    :param r: Радиус круга - целое|дробное десятичное число
    :type r: int | float

    :return: Периметр круга - целое|дробное десятичное число
    :rtype: float
    """
    return 2 * math.pi * r

