def area(a, b):
    """
    Принимает стороны прямоугольника a и b - возвращает его площадь

    Пример вызова:

    >>> area(7, 9)
    63

    :param a: Основание прямоугольника - целое|дробное десятичное число
    :type a: int | float
    :param b: Высота прямоугольника - целое|дробное десятичное число
    :type b: int | float

    :return: Площадь прямоугольника - целое|дробное десятичное число
    :rtype: int | float
    """
    return a * b 

def perimeter(a, b):
    """
    Принимает стороны прямоугольника a и b - возвращает его периметр

    Пример вызова:

    >>> perimeter(4, 8)
    24

    :param a: Основание прямоугольника - целое|дробное десятичное число
    :type a: int | float
    :param b: Высота прямоугольника - целое|дробное десятичное число
    :type b: int | float

    :return: Периметр прямоугольника - целое|дробное десятичное число
    :rtype: int | float
    """
    return 2 * (a + b) 
