
def area(a):
    """
    Принимает длину стороны квадрата (a) - возвращает его площадь

    Пример вызова:

    >>> area(4)
    16

    :param a: Сторона квадрата - целое|дробное десятичное число
    :type a: int | float

    :return: Площадь квадрата - целое|дробное десятичное число
    :rtype: int | float
    """
    return a * a


def perimeter(a):
    """
    Принимает длину стороны квадрата (a) - возвращает его периметр

    Пример вызова:

    >>> perimeter(4)
    16

    :param a: Сторона квадрата - целое|дробное десятичное число
    :type a: int | float

    :return: Периметр квадрата - целое|дробное десятичное число
    :rtype: int | float
    """
    return 4 * a
