def area(a, h):
    """
    Принимает длину основания (a) и высоту (h) треугольника, возвращает его площадь

    Пример вызова:

    >>> area(4, 3.2)
    6.4

    :param a: Длина основания треугольника - целое|дробное десятичное число
    :type a: int | float
    :param h: Высота треугольника - целое|дробное десятичное число
    :type h: int | float

    :return: Площадь треугольника - целое|дробное десятичное число
    :rtype: float
    """
    return a * h / 2 

def perimeter(a, b, c):
    """
    Принимает длины сторон треугольника a, b и c - возвращает его периметр

    Пример вызова:

    >>> perimeter(2, 4, 3.0)
    9.0

    :param a: Первая сторона треугольника - целое|дробное десятичное число
    :type a: int | float
    :param b: Вторая сторона треугольника - целое|дробное десятичное число
    :type b: int | float
    :param c: Третья сторона треугольника - целое|дробное десятичное число
    :type c: int | float
    
    :return: Периметр треугольника - целое|дробное десятичное число
    :rtype: int | float
    """
    return a + b + c 
